/// Patterns pour le pattern matching

use super::literals::Literal;
use super::types::Type;
use super::expressions::Expr;
use crate::parsing::token::Span;

// ─────────────────────────────────────────────────────────────────────────────
// Pattern de match
// ─────────────────────────────────────────────────────────────────────────────

#[derive(Debug, Clone, PartialEq)]
pub enum MatchPattern {
    /// Littéral : `42`, `"hello"`, `true`, `null`
    Literal(Literal),
    /// Test de type : `is int`, `is string`, `is null`, `is ClassName`
    IsType(Type),
}

// ─────────────────────────────────────────────────────────────────────────────
// Bras de match
// ─────────────────────────────────────────────────────────────────────────────

#[derive(Debug, Clone, PartialEq)]
pub struct MatchArm {
    /// `None` → bras `default`
    pub pattern: Option<MatchPattern>,
    pub body:    Expr,
    pub span:    Span,
}
